<?php
  /**
   * This file is created
   * by yybird
   * @2015.07.03
   * last modified
   * by yybird
   * @2015.07.10
  **/
?>


<?php
  // 共201个等级
  $level_strength = array(
    0,1,3,6,10,15,21,28,36,/*斗之气*/ 45,55,66,78,91,105,120,136,153,/*斗者*/ 171,190,210,231,253,276,300,325,351,/*斗师*/
    378,406,435,465,496,528,561,595,630,/*大斗师*/ 666,703,741,780,820,861,903,946,990,1035,/*斗灵*/
    1081,1128,1176,1225,1275,1326,1378,1431,1485,1540,/*斗王*/ 1596,1653,1711,1770,1830,1891,1953,2016,2080,2145,/*斗皇*/ 
    2211,2278,2346,2415,2485,2556,2628,2701,2775,2850,2926,3003,3081,3160,3240,/*斗宗1-5*/ 
    3321,3403,3486,3570,3655,3741,3828,3916,4005,4095,4186,4278,4371,4465,4560,/*斗宗6-巅峰*/ 
    4656,4753,4851,4950,5050,5151,5253,5356,5460,5565,5671,5778,5886,5995,6105,/*斗尊1-5*/ 
    6216,6328,6441,6555,6670,6786,6903,7021,7140,7260,7381,7503,/*斗尊6-9*/
    7626,7750,7875,8001,8128,8256,8385,8515,8646,/*斗尊巅峰1-9*/ 8778,8911,9045,/*半圣*/ 
    9180,9316,9453,9591,9730,9870,10011,10153,10296,10440,10585,10731,10878,11026,11175,/*斗圣1-5*/ 
    11325,11476,11628,11781,11935,12090,12246,12403,12561,12720,12880,13041,13203,13366,13530,/*斗圣6-巅峰*/ 
    13695,13861,14028,14196,14365,14535,14706,14878,15051,15225,15400,15576,/*斗帝*/
    15753,15931,16110,16290,16471,16653,16836,17020,17205,17391,17578,17766,/*斗帝主*/
    17955,18145,18336,18528,18721,18915,19110,19306,19503,19701,19900,20100/*斗比*/
  );
  $level_name = array(
    "斗之气一段","斗之气二段","斗之气三段","斗之气四段","斗之气五段","斗之气六段","斗之气七段","斗之气八段","斗之气九段",
    "斗者一星","斗者二星","斗者三星","斗者四星","斗者五星","斗者六星","斗者七星","斗者八星","斗者九星",
    "斗师一星","斗师二星","斗师三星","斗师四星","斗师五星","斗师六星","斗师七星","斗师八星","斗师九星",
    "大斗师一星","大斗师二星","大斗师三星","大斗师四星","大斗师五星","大斗师六星","大斗师七星","大斗师八星","大斗师九星",
    "斗灵一星","斗灵二星","斗灵三星","斗灵四星","斗灵五星","斗灵六星","斗灵七星","斗灵八星","斗灵九星","斗灵巅峰",
    "斗王一星","斗王二星","斗王三星","斗王四星","斗王五星","斗王六星","斗王七星","斗王八星","斗王九星","斗王巅峰",
    "斗皇一星","斗皇二星","斗皇三星","斗皇四星","斗皇五星","斗皇六星","斗皇七星","斗皇八星","斗皇九星","斗皇巅峰",
    "斗宗一星前期","斗宗一星中期","斗宗一星后期","斗宗二星前期","斗宗二星中期","斗宗二星后期",
    "斗宗三星前期","斗宗三星中期","斗宗三星后期","斗宗四星前期","斗宗四星中期","斗宗四星后期",
    "斗宗五星前期","斗宗五星中期","斗宗五星后期","斗宗六星前期","斗宗六星中期","斗宗六星后期",
    "斗宗七星前期","斗宗七星中期","斗宗七星后期","斗宗八星前期","斗宗八星中期","斗宗八星后期",
    "斗宗九星前期","斗宗九星中期","斗宗九星后期","斗宗巅峰前期","斗宗巅峰中期","斗宗巅峰后期",
    "斗尊一星前期","斗尊一星中期","斗尊一星后期","斗尊二星前期","斗尊二星中期","斗尊二星后期",
    "斗尊三星前期","斗尊三星中期","斗尊三星后期","斗尊四星前期","斗尊四星中期","斗尊四星后期",
    "斗尊五星前期","斗尊五星中期","斗尊五星后期","斗尊六星前期","斗尊六星中期","斗尊六星后期",
    "斗尊七星前期","斗尊七星中期","斗尊七星后期","斗尊八星前期","斗尊八星中期","斗尊八星后期",
    "斗尊九星前期","斗尊九星中期","斗尊九星后期",
    "斗尊一转","斗尊二转","斗尊三转","斗尊四转","斗尊五转","斗尊六转","斗尊七转","斗尊八转","斗尊九转",
    "半圣前期","半圣中期","半圣后期",
    "斗圣一星前期","斗圣一星中期","斗圣一星后期","斗圣二星前期","斗圣二星中期","斗圣二星后期",
    "斗圣三星前期","斗圣三星中期","斗圣三星后期","斗圣四星前期","斗圣四星中期","斗圣四星后期",
    "斗圣五星前期","斗圣五星中期","斗圣五星后期","斗圣六星前期","斗圣六星中期","斗圣六星后期",
    "斗圣七星前期","斗圣七星中期","斗圣七星后期","斗圣八星前期","斗圣八星中期","斗圣八星后期",
    "斗圣九星前期","斗圣九星中期","斗圣九星后期","斗圣巅峰前期","斗圣巅峰中期","斗圣巅峰后期",
    "斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝",
    "斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主","斗帝主",
    "斗比","斗比","斗比","斗比","斗比","斗比","斗比","斗比","斗比","斗比","斗比","斗比",
  );
  $level_color = array(
    "#E0E0E0","#d0d0d0","#BEBEBE","#ADADAD","#9D9D9D","#8E8E8E","#7B7B7B","#6C6C6C","#5B5B5B",  /*斗之气*/
    "#FF9797","#ff7575","#FF5151","#FF2D2D","#FF0000","#EA0000","#CE0000","#AE0000","#930000",  /*斗者*/
    "#FFC1E0","#ffaad5","#FF95CA","#FF79BC","#FF60AF","#FF359A","#FF0080","#F00078","#D9006C",  /*斗师*/
    "#FFBFFF","#ffa6ff","#FF8EFF","#FF77FF","#FF44FF","#FF00FF","#E800E8","#D200D2","#AE00AE",  /*大斗师*/
    "#DCB5FF","#d3a4ff","#CA8EFF","#BE77FF","#B15BFF","#9F35FF","#921AFF","#8600FF","#6F00D2","#5B00AE",  /*斗灵*/
    "#CECEFF","#B9B9FF","#AAAAFF","#9393FF","#7D7DFF","#6A6AFF","#4A4AFF","#2828FF","#0000E3","#0000C6",  /*斗王*/
    "#ACD6FF","#97CBFF","#84C1FF","#66B3FF","#46A3FF","#2894FF","#0080FF","#0072E3","#0066CC","#005AB5",  /*斗皇*/
    "#CAFFFF","#BBFFFF","#A6FFFF","#80FFFF","#4DFFFF","#00FFFF","#00E3E3","#00CACA","#00AEAE",  /*斗宗1-3*/
    "#C1FFE4","#ADFEDC","#96FED1","#7AFEC6","#4EFEB3","#1AFD9C","#02F78E","#02DF82","#02C874",  /*斗宗4-6*/
    "#BBFFBB","#A6FFA6","#93FF93","#79FF79","#53FF53","#28FF28","#00EC00","#00DB00","#00BB00","#00A600","#009100","#007500",  /*斗宗7-巅峰*/
    "#DEFFAC","#D3FF93","#CCFF80","#C2FF68","#B7FF4A","#A8FF24","#9AFF02","#8CEA00","#82D900",  /*斗尊1-3*/
    "#FFFFB9","#FFFFAA","#FFFF93","#FFFF6F","#FFFF37","#F9F900","#E1E100","#C4C400","#A6A600",  /*斗尊4-6*/
    "#FFF0AC","#FFED97","#FFE66F","#FFE153","#FFDC35","#FFD306","#EAC100","#D9B300","#C6A300",  /*斗尊7-9*/
    "#FFDCB9","#FFD1A4","#FFC78E","#FFBB77","#FFAF60","#FFA042","#FF9224","#FF8000","#EA7500",  /*斗尊九转*/
    "#D26900","#BB5E00","#9F5000",  /*半圣*/
    "#FFCBB3","#FFBD9D","#FFAD86","#FF9D6F","#FF8F59","#FF8040","#FF5809","#F75000","#D94600",  /*斗圣1-3*/
    "#D9B3B3","#CF9E9E","#C48888","#B87070","#AD5A5A","#984B4B","#804040","#743A3A","#613030",  /*斗圣4-6*/
    "#E8E8D0","#DEDEBE","#D6D6AD","#CDCD9A","#C2C287","#B9B973","#AFAF61","#A5A552","#949449","#808040","#707038","#616130",  /*斗圣7-巅峰*/
    "#D1E9E9","#C4E1E1","#B3D9D9","#A3D1D1","#95CACA","#81C0C0","#6FB7B7","#5CADAD","#4F9D9D","#408080","#3D7878","#336666",  /*斗帝*/
    "#F3F3FA","#E6E6F2","#D8D8EB","#C7C7E2","#B8B8DC","#A6A6D2","#9999CC","#8080C0","#7373B9","#5A5AAD","#5151A2","#484891",  /*斗帝主*/
    "#EBD3E8","#E2C2DE","#DAB1D5","#D2A2CC","#CA8EC2","#C07AB8","#B766AD","#AE57A4","#9F4D95","#8F4586","#7E3D76","#6C3365" /*斗比*/
  );
?>
